{
  "<PAD>": 0,
  "<UNK>": 1,
  "<BOS>": 2,
  "<EOS>": 3,
  "!": 4,
  "\"</w>": 5,
  "#": 6,
  "$": 7,
  "%</w>": 8,
  "&": 9,
  "'</w>": 10,
  "(</w>": 11,
  ")</w>": 12,
  "+</w>": 13,
  ",</w>": 14,
  "-</w>": 15,
  ".</w>": 16,
  "/</w>": 17,
  "0": 18,
  "00": 19,
  "0</w>": 20,
  "0s</w>": 21,
  "1": 22,
  "10</w>": 23,
  "19": 24,
  "196": 25,
  "197": 26,
  "198": 27,
  "199": 28,
  "1990s</w>": 29,
  "1</w>": 30,
  "2": 31,
  "20": 32,
  "200": 33,
  "201": 34,
  "2015</w>": 35,
  "2017</w>": 36,
  "2018</w>": 37,
  "202": 38,
  "2022</w>": 39,
  "2023</w>": 40,
  "2025</w>": 41,
  "2</w>": 42,
  "3": 43,
  "3</w>": 44,
  "4": 45,
  "4</w>": 46,
  "5": 47,
  "5</w>": 48,
  "6": 49,
  "6</w>": 50,
  "7": 51,
  "7</w>": 52,
  "8": 53,
  "8</w>": 54,
  "9": 55,
  "9</w>": 56,
  ":</w>": 57,
  ";</w>": 58,
  "<": 59,
  "</w>": 60,
  "=</w>": 61,
  ">": 62,
  "?</w>": 63,
  "A": 64,
  "A</w>": 65,
  "AI</w>": 66,
  "Al": 67,
  "An</w>": 68,
  "Ar": 69,
  "As</w>": 70,
  "At": 71,
  "B": 72,
  "B</w>": 73,
  "BE": 74,
  "BERT</w>": 75,
  "By</w>": 76,
  "C": 77,
  "C</w>": 78,
  "CA": 79,
  "Co": 80,
  "Con": 81,
  "D": 82,
  "D</w>": 83,
  "DNNs</w>": 84,
  "De": 85,
  "Deep": 86,
  "Deep</w>": 87,
  "Di": 88,
  "E": 89,
  "E</w>": 90,
  "En": 91,
  "English</w>": 92,
  "F": 93,
  "For</w>": 94,
  "G": 95,
  "G</w>": 96,
  "GP": 97,
  "GPT</w>": 98,
  "Ge": 99,
  "Gi": 100,
  "Goo": 101,
  "H": 102,
  "H</w>": 103,
  "Ho": 104,
  "I": 105,
  "I</w>": 106,
  "In": 107,
  "In</w>": 108,
  "It</w>": 109,
  "J": 110,
  "Jo": 111,
  "K": 112,
  "K</w>": 113,
  "L": 114,
  "L</w>": 115,
  "LL": 116,
  "LLM</w>": 117,
  "LLMs</w>": 118,
  "LP</w>": 119,
  "LST": 120,
  "LSTM</w>": 121,
  "Lan": 122,
  "Le": 123,
  "Lear": 124,
  "Learning</w>": 125,
  "M": 126,
  "M</w>": 127,
  "Many</w>": 128,
  "Me": 129,
  "Mo": 130,
  "Ms</w>": 131,
  "Multi": 132,
  "N": 133,
  "N</w>": 134,
  "NLP</w>": 135,
  "NN</w>": 136,
  "NNs</w>": 137,
  "Ne": 138,
  "Neu": 139,
  "No": 140,
  "Ns</w>": 141,
  "O": 142,
  "On</w>": 143,
  "OpenAI</w>": 144,
  "P": 145,
  "P</w>": 146,
  "Q": 147,
  "Q</w>": 148,
  "R": 149,
  "R</w>": 150,
  "RNN</w>": 151,
  "RT</w>": 152,
  "Re": 153,
  "Research</w>": 154,
  "S": 155,
  "S</w>": 156,
  "Se": 157,
  "So": 158,
  "Su": 159,
  "T": 160,
  "T</w>": 161,
  "Th": 162,
  "The</w>": 163,
  "U": 164,
  "U</w>": 165,
  "Un": 166,
  "Us</w>": 167,
  "V": 168,
  "V</w>": 169,
  "W": 170,
  "W</w>": 171,
  "Wor": 172,
  "X": 173,
  "X</w>": 174,
  "Y": 175,
  "Z": 176,
  "[": 177,
  "\\</w>": 178,
  "]": 179,
  "^</w>": 180,
  "_": 181,
  "_</w>": 182,
  "a": 183,
  "a</w>": 184,
  "ab": 185,
  "ac": 186,
  "accu": 187,
  "act</w>": 188,
  "acti": 189,
  "ad": 190,
  "addi": 191,
  "advan": 192,
  "ag": 193,
  "ai": 194,
  "al": 195,
  "al</w>": 196,
  "all</w>": 197,
  "allo": 198,
  "allows</w>": 199,
  "ally</w>": 200,
  "aly": 201,
  "amp": 202,
  "an": 203,
  "analy": 204,
  "and</w>": 205,
  "ans": 206,
  "ant</w>": 207,
  "anti": 208,
  "any</w>": 209,
  "ap": 210,
  "app": 211,
  "appli": 212,
  "applied</w>": 213,
  "ar": 214,
  "ard</w>": 215,
  "argu": 216,
  "art</w>": 217,
  "artificial</w>": 218,
  "ary</w>": 219,
  "as": 220,
  "at": 221,
  "au": 222,
  "auto": 223,
  "av": 224,
  "b": 225,
  "b</w>": 226,
  "bac": 227,
  "back": 228,
  "be": 229,
  "bed": 230,
  "being</w>": 231,
  "bet": 232,
  "betwe": 233,
  "bi": 234,
  "bo": 235,
  "both</w>": 236,
  "brea": 237,
  "bro": 238,
  "bu": 239,
  "buil": 240,
  "but</w>": 241,
  "by</w>": 242,
  "c": 243,
  "cal": 244,
  "can": 245,
  "cap": 246,
  "cce": 247,
  "ce": 248,
  "ce</w>": 249,
  "cep": 250,
  "ch": 251,
  "ch</w>": 252,
  "ci": 253,
  "clo": 254,
  "clu": 255,
  "co": 256,
  "cogni": 257,
  "cognitive</w>": 258,
  "com": 259,
  "comp": 260,
  "cre": 261,
  "cri": 262,
  "cu": 263,
  "cur": 264,
  "cy</w>": 265,
  "d": 266,
  "d</w>": 267,
  "da": 268,
  "dat": 269,
  "data</w>": 270,
  "de": 271,
  "deep</w>": 272,
  "descri": 273,
  "desig": 274,
  "dge</w>": 275,
  "di": 276,
  "dif": 277,
  "disp": 278,
  "display": 279,
  "divi": 280,
  "do": 281,
  "ds</w>": 282,
  "du": 283,
  "dual</w>": 284,
  "duc": 285,
  "due</w>": 286,
  "dy</w>": 287,
  "e": 288,
  "e</w>": 289,
  "ear": 290,
  "early</w>": 291,
  "ec": 292,
  "ed": 293,
  "ed</w>": 294,
  "ef": 295,
  "effici": 296,
  "efficient</w>": 297,
  "ek</w>": 298,
  "el": 299,
  "em": 300,
  "embed": 301,
  "en": 302,
  "ence</w>": 303,
  "enco": 304,
  "ency</w>": 305,
  "end</w>": 306,
  "ent</w>": 307,
  "enti": 308,
  "ep": 309,
  "ep</w>": 310,
  "equ": 311,
  "equi": 312,
  "er": 313,
  "er</w>": 314,
  "ers</w>": 315,
  "es</w>": 316,
  "et</w>": 317,
  "ex": 318,
  "examp": 319,
  "exi": 320,
  "exp": 321,
  "f": 322,
  "f</w>": 323,
  "fac": 324,
  "fe": 325,
  "feed": 326,
  "fi": 327,
  "fic": 328,
  "fic</w>": 329,
  "fici": 330,
  "ficial</w>": 331,
  "fiel": 332,
  "field</w>": 333,
  "fol": 334,
  "follo": 335,
  "for": 336,
  "form</w>": 337,
  "fra": 338,
  "frame": 339,
  "from</w>": 340,
  "fu": 341,
  "fun": 342,
  "func": 343,
  "function</w>": 344,
  "fur": 345,
  "fy</w>": 346,
  "fying</w>": 347,
  "g": 348,
  "g</w>": 349,
  "ge": 350,
  "ge</w>": 351,
  "gh": 352,
  "gh</w>": 353,
  "ght</w>": 354,
  "gi": 355,
  "gies</w>": 356,
  "glish</w>": 357,
  "gly</w>": 358,
  "gni": 359,
  "go": 360,
  "goal</w>": 361,
  "gra": 362,
  "gram": 363,
  "gre": 364,
  "gs</w>": 365,
  "gu": 366,
  "gua": 367,
  "gui": 368,
  "gy</w>": 369,
  "h": 370,
  "h</w>": 371,
  "ha": 372,
  "have</w>": 373,
  "he": 374,
  "heal": 375,
  "hi": 376,
  "high</w>": 377,
  "ho": 378,
  "how</w>": 379,
  "hu": 380,
  "i": 381,
  "i</w>": 382,
  "ic": 383,
  "ide": 384,
  "if</w>": 385,
  "il": 386,
  "ima": 387,
  "imp": 388,
  "in": 389,
  "inc": 390,
  "inclu": 391,
  "incre": 392,
  "inf": 393,
  "infor": 394,
  "ing</w>": 395,
  "input</w>": 396,
  "inputs</w>": 397,
  "instruc": 398,
  "inte": 399,
  "into</w>": 400,
  "intro": 401,
  "invol": 402,
  "ir": 403,
  "ir</w>": 404,
  "is</w>": 405,
  "it</w>": 406,
  "ith": 407,
  "its</w>": 408,
  "j": 409,
  "jec": 410,
  "ju": 411,
  "k": 412,
  "k</w>": 413,
  "ke": 414,
  "ke</w>": 415,
  "kin": 416,
  "king</w>": 417,
  "know": 418,
  "knowledge</w>": 419,
  "ks</w>": 420,
  "l": 421,
  "l</w>": 422,
  "la": 423,
  "lay": 424,
  "layer</w>": 425,
  "layers</w>": 426,
  "le": 427,
  "lear": 428,
  "learn</w>": 429,
  "learning</w>": 430,
  "ledge</w>": 431,
  "less</w>": 432,
  "li": 433,
  "like</w>": 434,
  "limi": 435,
  "lion</w>": 436,
  "lish": 437,
  "lish</w>": 438,
  "ll</w>": 439,
  "lo": 440,
  "loss</w>": 441,
  "low</w>": 442,
  "ls</w>": 443,
  "lu": 444,
  "ly</w>": 445,
  "lying</w>": 446,
  "m": 447,
  "m</w>": 448,
  "ma": 449,
  "maj": 450,
  "make</w>": 451,
  "making</w>": 452,
  "max</w>": 453,
  "may</w>": 454,
  "mbi": 455,
  "me": 456,
  "metho": 457,
  "method</w>": 458,
  "methods</w>": 459,
  "mi": 460,
  "might</w>": 461,
  "mo": 462,
  "mod": 463,
  "mode": 464,
  "model</w>": 465,
  "models</w>": 466,
  "mp": 467,
  "ms</w>": 468,
  "mu": 469,
  "multi": 470,
  "multip": 471,
  "n": 472,
  "n</w>": 473,
  "na": 474,
  "ne": 475,
  "ness</w>": 476,
  "network</w>": 477,
  "networks</w>": 478,
  "neu": 479,
  "new</w>": 480,
  "ni": 481,
  "ning</w>": 482,
  "no": 483,
  "not</w>": 484,
  "now": 485,
  "ns</w>": 486,
  "nu": 487,
  "num": 488,
  "o": 489,
  "o</w>": 490,
  "ob": 491,
  "objec": 492,
  "oc": 493,
  "of": 494,
  "of</w>": 495,
  "ol": 496,
  "on": 497,
  "on</w>": 498,
  "onal</w>": 499,
  "only</w>": 500,
  "ons</w>": 501,
  "oo": 502,
  "op": 503,
  "opti": 504,
  "optimi": 505,
  "or": 506,
  "or</w>": 507,
  "org": 508,
  "ory</w>": 509,
  "ou": 510,
  "ou</w>": 511,
  "ous": 512,
  "ous</w>": 513,
  "ously</w>": 514,
  "out": 515,
  "output</w>": 516,
  "outputs</w>": 517,
  "p": 518,
  "p</w>": 519,
  "par": 520,
  "pat": 521,
  "pe": 522,
  "pen": 523,
  "peop": 524,
  "per": 525,
  "perfor": 526,
  "ph": 527,
  "pi": 528,
  "po": 529,
  "poin": 530,
  "points</w>": 531,
  "posi": 532,
  "possi": 533,
  "pre": 534,
  "previ": 535,
  "pri": 536,
  "pro": 537,
  "prob": 538,
  "proce": 539,
  "process</w>": 540,
  "produc": 541,
  "program": 542,
  "promp": 543,
  "prompt</w>": 544,
  "prote": 545,
  "provi": 546,
  "ps</w>": 547,
  "pu": 548,
  "pub": 549,
  "pus</w>": 550,
  "put</w>": 551,
  "q": 552,
  "qu": 553,
  "quanti": 554,
  "que": 555,
  "r": 556,
  "r</w>": 557,
  "ra": 558,
  "re": 559,
  "rea": 560,
  "ree</w>": 561,
  "regre": 562,
  "requ": 563,
  "resear": 564,
  "research</w>": 565,
  "respec": 566,
  "ri": 567,
  "ro": 568,
  "rom</w>": 569,
  "ross</w>": 570,
  "ru": 571,
  "ruc": 572,
  "s": 573,
  "s</w>": 574,
  "sa": 575,
  "safe": 576,
  "sc": 577,
  "scri": 578,
  "se": 579,
  "sear": 580,
  "search</w>": 581,
  "see</w>": 582,
  "seg": 583,
  "sequ": 584,
  "sequence</w>": 585,
  "sh": 586,
  "si": 587,
  "sig": 588,
  "simi": 589,
  "sion</w>": 590,
  "sions</w>": 591,
  "sity</w>": 592,
  "sive</w>": 593,
  "size</w>": 594,
  "sk": 595,
  "sm</w>": 596,
  "so": 597,
  "soci": 598,
  "sp": 599,
  "spe": 600,
  "spec": 601,
  "speci": 602,
  "specific</w>": 603,
  "ss": 604,
  "ss</w>": 605,
  "ssi": 606,
  "st": 607,
  "strea": 608,
  "stream</w>": 609,
  "struc": 610,
  "sty": 611,
  "su": 612,
  "sub": 613,
  "succe": 614,
  "success": 615,
  "such</w>": 616,
  "suf": 617,
  "sugge": 618,
  "super": 619,
  "sur": 620,
  "sy": 621,
  "syn": 622,
  "t": 623,
  "t</w>": 624,
  "ta": 625,
  "task</w>": 626,
  "tasks</w>": 627,
  "te": 628,
  "th": 629,
  "th</w>": 630,
  "the": 631,
  "the</w>": 632,
  "their</w>": 633,
  "theory</w>": 634,
  "they</w>": 635,
  "tho": 636,
  "ti": 637,
  "tial</w>": 638,
  "ties</w>": 639,
  "tificial</w>": 640,
  "tion</w>": 641,
  "tional</w>": 642,
  "tions</w>": 643,
  "tive</w>": 644,
  "tly</w>": 645,
  "tmax</w>": 646,
  "to": 647,
  "to</w>": 648,
  "tok": 649,
  "tra": 650,
  "tree</w>": 651,
  "tri": 652,
  "trie": 653,
  "tro": 654,
  "ts</w>": 655,
  "tu": 656,
  "tual</w>": 657,
  "tur": 658,
  "tw": 659,
  "two</w>": 660,
  "twor": 661,
  "ty</w>": 662,
  "typ": 663,
  "u": 664,
  "ul": 665,
  "ulti": 666,
  "un": 667,
  "up</w>": 668,
  "v": 669,
  "v</w>": 670,
  "van": 671,
  "ve": 672,
  "ve</w>": 673,
  "vi": 674,
  "vie": 675,
  "vision</w>": 676,
  "visu": 677,
  "voc": 678,
  "vol": 679,
  "w": 680,
  "w</w>": 681,
  "wa": 682,
  "way</w>": 683,
  "we": 684,
  "wei": 685,
  "weigh": 686,
  "weights</w>": 687,
  "wh": 688,
  "wi": 689,
  "with": 690,
  "with</w>": 691,
  "wn</w>": 692,
  "wor": 693,
  "word</w>": 694,
  "words</w>": 695,
  "work</w>": 696,
  "worl": 697,
  "world</w>": 698,
  "writ": 699,
  "ws</w>": 700,
  "x": 701,
  "x</w>": 702,
  "y": 703,
  "y</w>": 704,
  "ying</w>": 705,
  "yna": 706,
  "yp": 707,
  "ys</w>": 708,
  "z": 709,
  "ze</w>": 710,
  "zed</w>": 711,
  "zing</w>": 712,
  "{</w>": 713,
  "|": 714,
  "}</w>": 715,
  "°": 716,
  "·": 717,
  "×": 718,
  "á": 719,
  "ü": 720,
  "Ġ": 721,
  "ń": 722,
  "Š": 723,
  "š": 724,
  "α": 725,
  "β": 726,
  "–</w>": 727,
  "—</w>": 728,
  "…": 729,
  "′": 730,
  "⁡": 731,
  "ℓ": 732,
  "↦": 733,
  "⇒": 734,
  "∈": 735,
  "∑": 736,
  "−": 737,
  "∞": 738,
  "∣": 739,
  "≤": 740,
  "⋮": 741
}