{
  "<PAD>": 0,
  "<UNK>": 1,
  "<BOS>": 2,
  "<EOS>": 3,
  ",</w>": 4,
  "-</w>": 5,
  ".</w>": 6,
  "</w>": 7,
  "A": 8,
  "A</w>": 9,
  "B": 10,
  "By</w>": 11,
  "C": 12,
  "D": 13,
  "E": 14,
  "F": 15,
  "G": 16,
  "H": 17,
  "I": 18,
  "L": 19,
  "M": 20,
  "Multi</w>": 21,
  "N": 22,
  "O": 23,
  "P": 24,
  "R": 25,
  "S": 26,
  "T": 27,
  "The</w>": 28,
  "This</w>": 29,
  "To": 30,
  "U": 31,
  "W": 32,
  "_": 33,
  "a": 34,
  "a</w>": 35,
  "ab": 36,
  "abili": 37,
  "ac": 38,
  "ad": 39,
  "ain": 40,
  "aining</w>": 41,
  "al": 42,
  "al</w>": 43,
  "amp": 44,
  "an": 45,
  "and</w>": 46,
  "ang": 47,
  "anguage</w>": 48,
  "anis": 49,
  "ans": 50,
  "ap": 51,
  "ar": 52,
  "archi": 53,
  "arn": 54,
  "as</w>": 55,
  "at": 56,
  "atten": 57,
  "attention</w>": 58,
  "ay": 59,
  "b": 60,
  "be": 61,
  "between</w>": 62,
  "bu": 63,
  "by</w>": 64,
  "c": 65,
  "ca": 66,
  "causal</w>": 67,
  "ce": 68,
  "ch": 69,
  "ch</w>": 70,
  "co": 71,
  "con": 72,
  "cre": 73,
  "cur": 74,
  "curve</w>": 75,
  "d": 76,
  "d</w>": 77,
  "data</w>": 78,
  "de": 79,
  "depen": 80,
  "di": 81,
  "diff": 82,
  "dimension</w>": 83,
  "do": 84,
  "ds</w>": 85,
  "du": 86,
  "e": 87,
  "e</w>": 88,
  "ec": 89,
  "ed</w>": 90,
  "embed": 91,
  "en": 92,
  "enc": 93,
  "ep</w>": 94,
  "er": 95,
  "er</w>": 96,
  "ers</w>": 97,
  "es</w>": 98,
  "f": 99,
  "fe": 100,
  "ff": 101,
  "fin": 102,
  "for": 103,
  "for</w>": 104,
  "form": 105,
  "from</w>": 106,
  "fun": 107,
  "function</w>": 108,
  "g": 109,
  "g</w>": 110,
  "ge</w>": 111,
  "gh": 112,
  "ghts</w>": 113,
  "ging</w>": 114,
  "h": 115,
  "he": 116,
  "hea": 117,
  "head</w>": 118,
  "i": 119,
  "ial</w>": 120,
  "ic": 121,
  "ies</w>": 122,
  "if": 123,
  "ili": 124,
  "imp": 125,
  "in": 126,
  "in</w>": 127,
  "ing": 128,
  "ing</w>": 129,
  "into</w>": 130,
  "is": 131,
  "is</w>": 132,
  "its</w>": 133,
  "j": 134,
  "jec": 135,
  "k": 136,
  "k</w>": 137,
  "ke": 138,
  "ken": 139,
  "king</w>": 140,
  "l": 141,
  "l</w>": 142,
  "language</w>": 143,
  "layers</w>": 144,
  "le": 145,
  "learn": 146,
  "learning</w>": 147,
  "lf</w>": 148,
  "li": 149,
  "lik": 150,
  "like</w>": 151,
  "lo": 152,
  "loss</w>": 153,
  "ls</w>": 154,
  "ly</w>": 155,
  "m": 156,
  "m</w>": 157,
  "ma": 158,
  "mas": 159,
  "masking</w>": 160,
  "max": 161,
  "me": 162,
  "men": 163,
  "mi": 164,
  "mo": 165,
  "mode": 166,
  "model</w>": 167,
  "models</w>": 168,
  "mp": 169,
  "multi": 170,
  "n": 171,
  "n</w>": 172,
  "ne": 173,
  "net": 174,
  "networks</w>": 175,
  "next</w>": 176,
  "o": 177,
  "o</w>": 178,
  "oc": 179,
  "of": 180,
  "of</w>": 181,
  "on": 182,
  "on</w>": 183,
  "onal</w>": 184,
  "ons</w>": 185,
  "or": 186,
  "or</w>": 187,
  "os</w>": 188,
  "ou": 189,
  "outpu": 190,
  "p": 191,
  "p</w>": 192,
  "pa": 193,
  "pair": 194,
  "pair</w>": 195,
  "pec": 196,
  "po": 197,
  "pre": 198,
  "predic": 199,
  "prediction</w>": 200,
  "pro": 201,
  "prob": 202,
  "proce": 203,
  "process</w>": 204,
  "projec": 205,
  "provi": 206,
  "pu": 207,
  "qu": 208,
  "r": 209,
  "ra": 210,
  "re": 211,
  "repre": 212,
  "ro": 213,
  "ross</w>": 214,
  "s": 215,
  "s</w>": 216,
  "se": 217,
  "self</w>": 218,
  "sequenc": 219,
  "sh": 220,
  "sho": 221,
  "si": 222,
  "spec": 223,
  "ss</w>": 224,
  "st": 225,
  "su": 226,
  "sub": 227,
  "t": 228,
  "t</w>": 229,
  "te": 230,
  "ten": 231,
  "text</w>": 232,
  "th": 233,
  "th</w>": 234,
  "the</w>": 235,
  "ti": 236,
  "tion</w>": 237,
  "tly</w>": 238,
  "to": 239,
  "to</w>": 240,
  "token</w>": 241,
  "tokeni": 242,
  "tokens</w>": 243,
  "tr": 244,
  "training</w>": 245,
  "transform": 246,
  "transformer</w>": 247,
  "ts</w>": 248,
  "ty</w>": 249,
  "u": 250,
  "ul": 251,
  "ular": 252,
  "un": 253,
  "ur": 254,
  "us": 255,
  "usal</w>": 256,
  "v": 257,
  "values</w>": 258,
  "ve": 259,
  "ve</w>": 260,
  "ver": 261,
  "vi": 262,
  "vo": 263,
  "w": 264,
  "w</w>": 265,
  "war": 266,
  "wei": 267,
  "wi": 268,
  "with</w>": 269,
  "wor": 270,
  "word</w>": 271,
  "work": 272,
  "works</w>": 273,
  "x": 274,
  "xt</w>": 275,
  "y": 276,
  "y</w>": 277,
  "z": 278,
  "ze</w>": 279,
  "zes</w>": 280
}